{"hello": 116, "how": 122, "can": 54, "assist": 28, "you": 305, "with": 300, "your": 306, "financial": 92, "goals": 106, "today": 274, "hi": 118, "there": 268, "ready": 207, "to": 273, "tackle": 261, "some": 244, "planning": 198, "goodbye": 108, "stay": 251, "financially": 93, "savvy": 227, "wishing": 299, "success": 259, "see": 230, "next": 172, "time": 272, "self": 232, "financing": 94, "starts": 250, "budgeting": 45, "saving": 225, "and": 24, "investing": 130, "wisely": 298, "let": 141, "explore": 87, "strategies": 255, "help": 117, "achieve": 13, "independence": 126, "rental": 212, "properties": 199, "dividend": 75, "stocks": 254, "side": 240, "businesses": 47, "are": 25, "great": 110, "ways": 294, "generate": 101, "income": 125, "minimal": 157, "effort": 79, "several": 236, "types": 278, "of": 176, "mortgages": 165, "in": 124, "the": 266, "uk": 279, "fixed": 97, "rate": 204, "interest": 128, "stays": 252, "same": 223, "for": 100, "set": 234, "period": 196, "variable": 292, "change": 56, "tracker": 276, "follows": 99, "bank": 32, "england": 81, "base": 33, "offset": 178, "links": 145, "savings": 226, "mortgage": 164, "guarantor": 113, "family": 89, "member": 155, "guarantees": 112, "loan": 148, "shared": 238, "ownership": 188, "buy": 49, "share": 237, "pay": 191, "rent": 211, "on": 179, "rest": 219, "first": 96, "buyers": 50, "should": 239, "check": 59, "their": 267, "credit": 66, "score": 229, "start": 249, "deposit": 73, "at": 29, "least": 137, "but": 48, "10": 1, "20": 3, "is": 131, "better": 38, "work": 302, "out": 184, "much": 168, "they": 270, "afford": 17, "understand": 281, "extra": 88, "costs": 64, "research": 218, "government": 109, "schemes": 228, "most": 166, "lenders": 140, "require": 216, "or": 181, "25": 4, "gets": 103, "deals": 70, "goal": 105, "break": 42, "it": 133, "into": 129, "monthly": 161, "targets": 263, "consider": 62, "using": 288, "lifetime": 143, "isa": 132, "bonus": 40, "pick": 197, "right": 221, "account": 12, "create": 65, "stick": 253, "budget": 44, "cut": 67, "unnecessary": 282, "spending": 247, "look": 149, "essentials": 83, "streams": 256, "use": 286, "discounts": 74, "vouchers": 293, "try": 277, "no": 173, "spend": 246, "months": 162, "ask": 27, "if": 123, "needed": 170, "key": 136, "terms": 265, "ltv": 151, "value": 291, "percentage": 195, "property": 200, "borrow": 41, "arrangement": 26, "fee": 90, "what": 295, "lender": 139, "charges": 58, "up": 285, "remortgaging": 210, "means": 154, "switching": 260, "new": 171, "deal": 69, "will": 297, "get": 102, "290": 6, "000": 0, "home": 120, "14": 2, "500": 9, "29": 5, "72": 10, "bigger": 39, "offer": 177, "lower": 150, "rates": 205, "more": 163, "flexible": 98, "have": 115, "higher": 119, "lisa": 146, "under": 280, "40": 7, "save": 224, "year": 304, "which": 296, "be": 35, "used": 287, "450": 8, "realistic": 208, "setting": 235, "standing": 248, "orders": 182, "so": 243, "money": 159, "goes": 107, "automatically": 30, "each": 77, "month": 160, "review": 220, "habits": 114, "back": 31, "non": 174, "like": 144, "daily": 68, "coffees": 61, "unused": 283, "subscriptions": 258, "utilities": 289, "groceries": 111, "selling": 233, "unwanted": 284, "items": 134, "taking": 262, "gigs": 104, "monetising": 158, "skill": 241, "even": 85, "small": 242, "amounts": 23, "add": 14, "over": 185, "qualify": 203, "homes": 121, "these": 269, "make": 152, "buying": 51, "affordable": 18, "expect": 86, "fees": 91, "valuation": 290, "legal": 138, "sometimes": 245, "do": 76, "not": 175, "keep": 135, "repayments": 214, "may": 153, "repossessed": 215, "always": 21, "carefully": 55, "insurance": 127, "protect": 201, "yourself": 307, "buildings": 46, "required": 217, "life": 142, "protection": 202, "also": 20, "worth": 303, "considering": 63, "circumstances": 60, "allow": 19, "overpay": 186, "without": 301, "penalties": 193, "overpaying": 187, "reduce": 209, "term": 264, "total": 275, "charge": 57, "penalty": 194, "repay": 213, "early": 78, "move": 167, "before": 36, "ends": 80, "think": 271, "might": 156, "debts": 71, "living": 147, "decide": 72, "about": 11, "payments": 192, "especially": 82, "rise": 222, "online": 180, "calculators": 53, "estimate": 84, "based": 34, "amount": 22, "adviser": 16, "broker": 43, "find": 95, "best": 37, "navigate": 169, "paperwork": 190, "others": 183, "paid": 189, "by": 52, "seek": 231, "advice": 15, "re": 206, "struggling": 257}